# 1. load, prepare, manipulate, model, and analyze

# 2.data structures:Series,DataFrame,Panel

In [ ]:
pip install beautifultable

Collecting beautifultable
  Downloading https://files.pythonhosted.org/packages/00/f8/63a013f19d6b4a2f9cc8706a98ad6261bff4941de4472a1b5e828803335d/beautifultable-1.0.0-py2.py3-none-any.whl
Requirement already satisfied: wcwidth in /usr/local/lib/python3.6/dist-packages (from beautifultable) (0.2.5)
Installing collected packages: beautifultable
Successfully installed beautifultable-1.0.0

In [ ]:
from beautifultable import BeautifulTable
table = BeautifulTable()
table.column_headers = ["Data Structure", "Dimensions", "Description"]
table.append_row(["Series", 1, "1D labeled homogeneous array, sizeimmutable."])
table.append_row(["Data Frames",2, "General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns."])
table.append_row(["Panel", 3, "General 3D labeled, size-mutable array."])
print(table)

+----------------+------------+------------------------------------------------+
| Data Structure | Dimensions |                  Description                   |
+----------------+------------+------------------------------------------------+
|     Series     |     1      |  1D labeled homogeneous array, sizeimmutable.  |
+----------------+------------+------------------------------------------------+
|  Data Frames   |     2      | General 2D labeled, size-mutable tabular struc |
|                |            | ture with potentially heterogeneously typed co |
|                |            |                     lumns.                     |
+----------------+------------+------------------------------------------------+
|     Panel      |     3      |    General 3D labeled, size-mutable array.     |
+----------------+------------+------------------------------------------------+

/usr/local/lib/python3.6/dist-packages/beautifultable/utils.py:113: FutureWarning: 'BeautifulTable.column_headers' has been deprecated in 'v1.0.0' and will be removed in 'v1.2.0'. Use 'BTColumnCollection.header' instead.
  warnings.warn(message, FutureWarning)
/usr/local/lib/python3.6/dist-packages/beautifultable/utils.py:113: FutureWarning: 'BeautifulTable.append_row' has been deprecated in 'v1.0.0' and will be removed in 'v1.2.0'. Use 'BTRowCollection.append' instead.
  warnings.warn(message, FutureWarning)

# Series

# pandas.Series( data, index, dtype, copy)

### 1.Homogeneous data
### 2.Size Immutable
### 3.Values of Data Mutable

In [ ]:
table = BeautifulTable()
table.column_headers = ["index","-->","0", "1", "3","4", "5", "6","7", "8", "9","10"]
table.append_row(['Int Data','-->',11,22,33,44,55,66,77,88,99,100])
table.append_row(['String Data','-->','a','b','c','d','e','f','g','h','i','j'])
print(table)

+-------------+-----+----+----+----+----+----+----+----+----+----+-----+
|    index    | --> | 0  | 1  | 3  | 4  | 5  | 6  | 7  | 8  | 9  | 10  |
+-------------+-----+----+----+----+----+----+----+----+----+----+-----+
|  Int Data   | --> | 11 | 22 | 33 | 44 | 55 | 66 | 77 | 88 | 99 | 100 |
+-------------+-----+----+----+----+----+----+----+----+----+----+-----+
| String Data | --> | a  | b  | c  | d  | e  | f  | g  | h  | i  |  j  |
+-------------+-----+----+----+----+----+----+----+----+----+----+-----+

/usr/local/lib/python3.6/dist-packages/beautifultable/utils.py:113: FutureWarning: 'BeautifulTable.column_headers' has been deprecated in 'v1.0.0' and will be removed in 'v1.2.0'. Use 'BTColumnCollection.header' instead.
  warnings.warn(message, FutureWarning)
/usr/local/lib/python3.6/dist-packages/beautifultable/utils.py:113: FutureWarning: 'BeautifulTable.append_row' has been deprecated in 'v1.0.0' and will be removed in 'v1.2.0'. Use 'BTRowCollection.append' instead.
  warnings.warn(message, FutureWarning)

In [ ]:
import pandas as pd
print(pd.__doc__)

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

# Create a Series from ndarray

In [ ]:
import pandas as pd
s = pd.Series()
print (s)

Series([], dtype: float64)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

In [ ]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print (s)

100    a
101    b
102    c
103    d
dtype: object

###### Datasourse=ndarray
###### index=same length of datasourse    

but by default range(n) where n is array length   

## [range(len(array))-1].

# Create a Series from dict

In [ ]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print (s)

a    0.0
b    1.0
c    2.0
dtype: float64

### Dictionary keys are used to construct index.

In [ ]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}                               
 
s = pd.Series(data,index=['b','c','d','a'])
 
r = pd.Series(data,index=['a','b','c','d','e'])
print (s)
print("---------")
print (r)

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64
---------
a    0.0
b    1.0
c    2.0
d    NaN
e    NaN
dtype: float64

### Index order is persisted and the missing element is filled with NaN (Not a Number).

# Create a Series from Scalar

In [ ]:
s = pd.Series(5, index=[0, 1, 2, 3])
print (s)

0    5
1    5
2    5
3    5
dtype: int64

### If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

# Accessing Data from Series with Position

In [ ]:
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
 
#retrieve the first element
print(s[[0,2]])

a    1
c    3
dtype: int64

In [ ]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first three element
print (s[:3])

a    1
b    2
c    3
dtype: int64

In [ ]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
 
#retrieve the last three element
print (s[-3:])

c    3
d    4
e    5
dtype: int64

# Retrieve Data Using Label (Index)

In [ ]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve a single element
print (s['a'])

1

In [ ]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve multiple elements
print (s[['a','c','d']])

a    1
c    3
d    4
dtype: int64

In [ ]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve multiple elements
print (s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

# DataFrame

## A Data frame is a two-dimensional data structure.
## data is aligned in a tabular fashion in rows and columns.

### Potentially columns are of different types
### Size – Mutable
### Labeled axes (rows and columns)
### Can Perform Arithmetic operations on rows and columns

##  pandas.DataFrame( data, index, columns, dtype, copy)

In [ ]:
from beautifultable import BeautifulTable
table = BeautifulTable()
table.column_headers = ["col1", "col2", "col3"]
table.append_row(["row1","row1","row1"])
table.append_row(["row2","row2","row2"])
table.append_row(["row3","row2","row3"])
table.append_row(["row4","row4","row4"])
table.append_row(["row5","row5","row5"])
table.append_row(["row6","row6","row6"])
table.append_row(["row7","row7","row7"])
table.append_row(["row8","row8","row8"])
table.append_row(["row9","row9","row9"])
 
print(table)

ModuleNotFoundError: ignored

## Create an Empty DataFrame

In [ ]:
import pandas as pd
df = pd.DataFrame()
p=pd.Series()
print(df)

Empty DataFrame
Columns: []
Index: []

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

## Create a DataFrame from Lists

In [ ]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
 
 
print (df)

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],index=['a','b','c'])

print (df)

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [ ]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print (df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

### Create a DataFrame from Dict of ndarrays / Lists

In [ ]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print (df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [ ]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print (df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

### Create a DataFrame from List of Dicts

In [ ]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20},{'a': 5, 'b': 10, 'c': 20,'d':35}]
df = pd.DataFrame(data)
print (df)

   a   b     c     d
0  1   2   NaN   NaN
1  5  10  20.0   NaN
2  5  10  20.0  35.0

In [ ]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
print (df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [ ]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
 
#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])
 
#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['c', 'd'])
print (df1)
print (df2)

        a   b
first   1   2
second  5  10
           c   d
first    NaN NaN
second  20.0 NaN

### Create a DataFrame from Dict of Series

In [ ]:
d = {'one' : pd.Series([1, 2, 3,], index=['a', 'b', 'c',]),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
     'three' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df)

   one  two  three
a  1.0    1      1
b  2.0    2      2
c  3.0    3      3
d  NaN    4      4

### Column Selection

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print (df ['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

### Column Addition

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
 
df = pd.DataFrame(d)
 
# Adding a new column to an existing DataFrame object with column label by passing new series
 
print ("Adding a new column by passing as Series:")
print ("------------------------------------------")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
print (df)
print ("-------------------------------------------------------------")
print ("Adding a new column using the existing columns in DataFrame:")
print ("-------------------------------------------------------------")
df['four']=df['one']+df['three']
 
print (df)

Adding a new column by passing as Series:
------------------------------------------
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
-------------------------------------------------------------
Adding a new column using the existing columns in DataFrame:
-------------------------------------------------------------
   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

### Column Deletion

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
     'three' : pd.Series([10,20,30], index=['a','b','c'])}
 
df = pd.DataFrame(d)
print ("Our dataframe is:")
print ("------------------------------------")
print (df)
 
# using del function
print ("Deleting the first column using DEL function:")
print ("--------------------------------------")
del df['one']
print (df)
 
# using pop function
print ("Deleting another column using POP function:")
print ("----------------------------------------")
df.pop('two')
print(df)

Our dataframe is:
------------------------------------
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Deleting the first column using DEL function:
--------------------------------------
   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN
Deleting another column using POP function:
----------------------------------------
   three
a   10.0
b   20.0
c   30.0
d    NaN

### Row Selection, Addition, and Deletion

#### Selection by Label

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)
print("---------------------------------")
print (df.loc['a'])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
---------------------------------
one    1.0
two    1.0
Name: a, dtype: float64

#### Selection by integer location

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
 
df = pd.DataFrame(d)
print(df)
print("---------------------------------")
print (df.iloc[2])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
---------------------------------
one    3.0
two    3.0
Name: c, dtype: float64

#### Slice Rows

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)
print("---------------------------------")
print(df[2:4])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
---------------------------------
   one  two
c  3.0    3
d  NaN    4

#### Addition of Rows

In [ ]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print (df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

#### Deletion of Rows

In [ ]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print (df)
print("-----------------------")
# Drop rows with label 0
df = df.drop(0)

print (df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8
-----------------------
   a  b
1  3  4
1  7  8

# Series Basic Functionality*

##### 1.axes(Returns a list of the row axis labels)
##### 2.dtype(Returns the dtype of the object.)
##### 3.empty(Returns True if series is empty.)
##### 4.ndim(Returns the number of dimensions of the underlying data, by definition 1.)
##### 5.size(Returns the number of elements in the underlying data.)
##### 6.values(Returns the Series as ndarray.)
##### 7.head()(Returns the first n rows.)
##### 8.tail()(Returns the last n rows)

In [ ]:
import pandas as pd
import numpy as np

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print (s)

0   -0.317853
1   -2.642315
2   -0.589768
3   -0.478489
dtype: float64

## axes

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print ("The axes are:")
print (s.axes)
print (s)

The axes are:
[RangeIndex(start=0, stop=4, step=1)]
0    0.528438
1    0.894174
2    0.639060
3    0.056696
dtype: float64

## empty

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print ("Is the Object empty?")
print (s.empty)

Is the Object empty?
False

## ndim

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print (s)

print ("The dimensions of the object:")
print (s.ndim)

0    0.154259
1    1.347884
2    0.641988
3   -0.622020
dtype: float64
The dimensions of the object:
1

## size

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(2))
print (s)
print ("The size of the object:")
print (s.size)

0    1.273891
1    0.069509
dtype: float64
The size of the object:
2

## values

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print (s)

print ("The actual data series is:")
print (s.values)

0    0.211108
1   -1.466126
2   -1.669991
3    1.323870
dtype: float64
The actual data series is:
[ 0.21110801 -1.4661257  -1.66999077  1.32387041]

## Head & Tail

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print ("The original series is:")
print (s)
print("------------------------------")
print ("The first two rows of the data series:")
print (s.head(2))
print (s.tail(2))

The original series is:
0   -1.388903
1   -0.348833
2    1.565724
3    0.373640
dtype: float64
------------------------------
The first two rows of the data series:
0   -1.388903
1   -0.348833
dtype: float64
2    1.565724
3    0.373640
dtype: float64

In [ ]:
#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print ("The original series is:")
print (s)

print ("The last two rows of the data series:")
print (s.tail(2))

The original series is:
0   -0.830466
1    0.494064
2   -0.230857
3   -1.279266
dtype: float64
The last two rows of the data series:
2   -0.230857
3   -1.279266
dtype: float64

# DataFrame Basic Functionality*

#### 1.T-Transposes rows and columns.
#### 2.axes-Returns a list with the row axis labels and column axis labels as the only members.
#### 3.dtypes-Returns the dtypes in this object.
#### 4.empty-True if NDFrame is entirely empty [no items]; if any of the axes are of length 0.
#### 5.ndim-Number of axes / array dimensions.
#### 6.shape-Returns a tuple representing the dimensionality of the DataFrame.
#### 7.size-Number of elements in the NDFrame.
#### 8.values-Numpy representation of NDFrame.
#### 9.head()-Returns the first n rows.
#### 10.tail()-Returns last n rows.

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("Our data series is:")
print (df)

Our data series is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

## T (Transpose)

In [ ]:
# Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

# Create a DataFrame
df = pd.DataFrame(d)
print ("The transpose of the data series is:")
print (df.T)

The transpose of the data series is:
           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

## axes

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print(df)
print("------------------------------------------")
print ("Row axis labels and column axis labels are:")
print (df.axes)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
------------------------------------------
Row axis labels and column axis labels are:
[RangeIndex(start=0, stop=7, step=1), Index(['Name', 'Age', 'Rating'], dtype='object')]

## dtypes

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','vin','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print(df)
print("------------------------------------------")
print ("The data types of each column are:")
print (df.dtypes)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2      7   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
------------------------------------------
The data types of each column are:
Name       object
Age         int64
Rating    float64
dtype: object

## empty

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
 
#Create a DataFrame
df = pd.DataFrame(d)
df = pd.DataFrame(d)
print(df)
print("------------------------------------------")
print ("Is the object empty?")
print (df.empty)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
------------------------------------------
Is the object empty?
False

## ndim

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("Our object is:")
print (df)
print ("The dimension of the object is:")
print (df.ndim)

Our object is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The dimension of the object is:
2

## shape

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
 
#Create a DataFrame
df = pd.DataFrame(d)
print ("Our object is:")
print (df)
print ("The shape of the object is:")
print (df.shape)

Our object is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The shape of the object is:
(7, 3)

## size

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
 
#Create a DataFrame
df = pd.DataFrame(d)
print ("Our object is:")
print (df)
print ("The total number of elements in our object is:")
print (df.size)

Our object is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The total number of elements in our object is:
21

## values

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
 
#Create a DataFrame
df = pd.DataFrame(d)
print ("Our object is:")
print (df)
print ("The actual data in our data frame is:")
print (df.values)

Our object is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The actual data in our data frame is:
[['Tom' 25 4.23]
 ['James' 26 3.24]
 ['Ricky' 25 3.98]
 ['Vin' 23 2.56]
 ['Steve' 30 3.2]
 ['Smith' 29 4.6]
 ['Jack' 23 3.8]]

## Head & Tail

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("Our data frame is:")
print (df)
print ("The first two rows of the data frame is:")
print (df.head(2))
print ("The last two rows of the data frame is:")
print (df.tail(2))

Our data frame is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The first two rows of the data frame is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]), 
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
 
#Create a DataFrame
df = pd.DataFrame(d)
print ("Our data frame is:")
print (df)
print ("The last two rows of the data frame is:")
print (df.tail(2))

Our data frame is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The last two rows of the data frame is:
    Name  Age  Rating
5  Smith   29     4.6
6   Jack   23     3.8

# Statistics

## DataFrame − “index” (axis=0, default), “columns” (axis=1)

In [ ]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print (df)

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

## sum()

### axis=0

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David',
                       'Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}
 
#Create a DataFrame
df = pd.DataFrame(d)
 
print (df.sum())
 
print (df.sum(1))

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

### axis=1

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}
 
#Create a DataFrame
df = pd.DataFrame(d)
print (df.sum(1))

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

## mean()

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print (df.mean())
print (df.std())

Age       31.833333
Rating     3.743333
dtype: float64

## std()

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print (df.std())

Age       9.232682
Rating    0.661628
dtype: float64

#### 1	count()	Number of non-null observations
#### 2	sum()	Sum of values
#### 3	mean()	Mean of Values
#### 4	median()	Median of Values
#### 5	mode()	Mode of values
#### 6	std()	Standard Deviation of the Values
#### 7	min()	Minimum Value
#### 8	max()	Maximum Value
#### 9	abs()	Absolute Value
#### 10	prod()	Product of Values
#### 11	cumsum()	Cumulative Sum
#### 12	cumprod()	Cumulative Product

## Summarizing Data

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print (df.describe())

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
                       'Lee','David','Gasper','Betina','Andres','Vin']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
} 

#Create a DataFrame
df = pd.DataFrame(d)
print (df.describe(include=['object']))
## need to check


print (df. describe(include='all'))

       Name
count    13
unique   12
top     Vin
freq      2

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith',
                       'Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}
 
#Create a DataFrame
df = pd.DataFrame(d)
print (df. describe(include='all'))

         Name        Age     Rating
count      12  12.000000  12.000000
unique     12        NaN        NaN
top     James        NaN        NaN
freq        1        NaN        NaN
mean      NaN  31.833333   3.743333
std       NaN   9.232682   0.661628
min       NaN  23.000000   2.560000
25%       NaN  25.000000   3.230000
50%       NaN  29.500000   3.790000
75%       NaN  35.500000   4.132500
max       NaN  51.000000   4.800000

## Function Application

### To apply your own or another library’s functions to Pandas objects, 
### you should be aware of the three important methods.
### The methods have been discussed below. 
### The appropriate method to use depends on whether your function expects to operate on an entire DataFrame,
### row- or column-wise, or element wise.To apply your own or another library’s functions to Pandas objects, 
### you should be aware of the three important methods. 
### The methods have been discussed below. 
### The appropriate method to use depends on whether your function expects to operate on an entire DataFrame,
### row- or column-wise, or element wise.

## Table wise Function Application: pipe()
## Row or Column Wise Function Application: apply()
## Element wise Function Application: applymap()

## Table-wise Function Application

In [ ]:
import pandas as pd
import numpy as np
def adder(ele1,ele2):
    return ele1+ele2

df = pd.DataFrame(np.random.randn(5,4),columns=['col1','col2','col3','col4'])
print(df)
df.pipe(adder,2)
print("---------------------------------------")
print("Mean Value Col wise")
print (df.apply(np.mean))

       col1      col2      col3      col4
0 -0.149205  0.013828 -0.528207 -1.675257
1 -0.514564 -0.957603  0.611705  0.807687
2  0.582534 -1.502291  0.394036  1.016741
3 -2.246988 -0.403791  0.048024  0.196800
4 -0.870376  1.478773  0.252962 -0.284473
---------------------------------------
Mean Value Col wise
col1   -0.639720
col2   -0.274217
col3    0.155704
col4    0.012299
dtype: float64

In [ ]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
print(df)
df.apply(np.mean)
print("---------------------------------------")
print("Mean Value Col wise")
print (df.apply(np.mean))

       col1      col2      col3
0 -2.670242  0.348195  0.777135
1 -0.641507  0.303381  0.731934
2 -0.895044 -1.049973 -0.824933
3 -0.511183 -1.414205 -1.555488
4 -0.443780  0.345457 -0.671568
---------------------------------------
Mean Value Col wise
col1   -1.032351
col2   -0.293429
col3   -0.308584
dtype: float64

In [ ]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
print(df)
df.apply(np.mean)
print("---------------------------------------")
df.apply(np.mean,axis=1)
print (df.apply(np.mean))

       col1      col2      col3
0 -0.751370 -2.341935 -0.204023
1  1.733309  0.537332 -0.675542
2 -0.287291 -0.517764  0.997821
3  1.404652 -0.902468  0.291382
4  0.038873 -1.052316  0.460822
---------------------------------------
col1    0.427635
col2   -0.855430
col3    0.174092
dtype: float64

In [ ]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df.apply(lambda x: x.max() - x.min())
print (df.apply(np.mean))

col1   -0.183249
col2   -0.377933
col3    0.051039
dtype: float64

### Element Wise Function Application

In [ ]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

# My custom function
df['col1'].map(lambda x:x*100)
df.apply(np.mean)

col1   -0.070439
col2   -0.794149
col3   -0.419459
dtype: float64

In [ ]:
# My custom function
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df.applymap(lambda x:x*100)
df.apply(np.mean)

col1    0.144011
col2    0.425743
col3   -0.405552
dtype: float64

# Reindexing

### Reindexing changes the row labels and column labels of a DataFrame.
### To reindex means to conform the data to match a given set of labels along a particular axis

### 1.Reorder the existing data to match a new set of labels.

### 2.Insert missing value (NA) markers in label locations where no data for the label existed.

In [ ]:
import pandas as pd
import numpy as np
 
N=20
 
df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})
 
print(df)
 
 
#reindex the DataFrame
df_reindexed = df.reindex(index=[0,2,5], columns=['A', 'C', 'B'])
 
df_reindexed

            A     x         y       C           D
0  2016-01-01   0.0  0.995909    High   98.301895
1  2016-01-02   1.0  0.569441  Medium  106.552793
2  2016-01-03   2.0  0.049169     Low   87.155786
3  2016-01-04   3.0  0.127914    High  107.253941
4  2016-01-05   4.0  0.828239     Low   69.404711
5  2016-01-06   5.0  0.596229     Low   88.741476
6  2016-01-07   6.0  0.302876    High  105.450701
7  2016-01-08   7.0  0.843235  Medium  105.088818
8  2016-01-09   8.0  0.807067     Low   76.055904
9  2016-01-10   9.0  0.077269     Low   91.040080
10 2016-01-11  10.0  0.271647     Low  107.110245
11 2016-01-12  11.0  0.581245     Low  106.467854
12 2016-01-13  12.0  0.543981  Medium   88.690292
13 2016-01-14  13.0  0.383533  Medium  109.853450
14 2016-01-15  14.0  0.890162  Medium  105.576202
15 2016-01-16  15.0  0.456704     Low  107.105459
16 2016-01-17  16.0  0.918518    High  102.079795
17 2016-01-18  17.0  0.588079    High   91.395092
18 2016-01-19  18.0  0.342651     Low   99.550474
19 2016-01-20  19.0  0.207403     Low  101.118158

           A     C   B
0 2016-01-01  High NaN
2 2016-01-03   Low NaN
5 2016-01-06   Low NaN

### Reindex to Align with Other Objects

In [ ]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])
df3 = pd.DataFrame(np.random.randn(7,3),columns=['COL1','COL2','COL3'])

print (df1)
print("----------------------------------")
print (df2)
print("----------------------------------")
print (df3)
print("----------------------------------")
df1 = df1.reindex_like(df2)
df4 = df1.reindex_like(df3)
print("----------------------------------")

print(df1)
print("----------------------------------")
print(df4)

       col1      col2      col3
0  0.736143 -0.361173  0.541433
1 -1.348450  0.550231 -0.913716
2  0.413242 -1.430852  0.642477
3 -0.834715 -0.647660  0.414902
4  0.434713 -0.291745 -0.646421
5 -0.505899  0.313851  1.746002
6  1.253641  1.123345  1.875058
7 -2.638243  0.129680 -0.893373
8  1.309346 -1.197606  0.765233
9 -0.508995  0.204547  0.534999
----------------------------------
       col1      col2      col3
0 -1.034772  1.327101  2.082269
1 -2.002302  3.143454 -0.954577
2 -1.462843 -0.400151  0.021789
3  0.021267  0.740828  1.424252
4 -0.299386 -1.037785 -0.765792
5 -0.032733 -0.222151  0.947290
6 -0.071493 -0.810454 -2.672621
----------------------------------
       COL1      COL2      COL3
0 -0.637391  0.408611 -1.042959
1  0.424827  0.369806  1.232612
2  0.705332  0.301448  0.328423
3  1.142844 -0.509134  0.196338
4 -0.135726  0.753117  1.303301
5  0.252629  1.434505 -0.429799
6 -0.249613  0.288974 -0.444841
----------------------------------
----------------------------------
       col1      col2      col3
0  0.736143 -0.361173  0.541433
1 -1.348450  0.550231 -0.913716
2  0.413242 -1.430852  0.642477
3 -0.834715 -0.647660  0.414902
4  0.434713 -0.291745 -0.646421
5 -0.505899  0.313851  1.746002
6  1.253641  1.123345  1.875058
----------------------------------
   COL1  COL2  COL3
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2   NaN   NaN   NaN
3   NaN   NaN   NaN
4   NaN   NaN   NaN
5   NaN   NaN   NaN
6   NaN   NaN   NaN

## Filling while ReIndexing

### 1.pad/ffill − Fill values forward

### 2.bfill/backfill − Fill values backward

### 3.nearest − Fill from the nearest index values

In [ ]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])

print(df1)
print("----------------------------------------")
print(df2)
print("------------------------------------------")

print(df2.reindex_like(df1))

# Now Fill the NAN's with preceding Values
print ("Data Frame with Forward Fill:")
print(df2.reindex_like(df1,method='ffill'))

       col1      col2      col3
0 -1.440776 -1.552530 -0.690466
1  0.426371 -0.628339  0.415514
2  0.629875 -0.869598 -1.328801
3 -1.265725  0.066665  1.325255
4 -1.285413  0.778628 -0.422697
5  2.326649  1.177586 -0.941432
----------------------------------------
       col1      col2      col3
0 -1.802586  0.797385 -0.614944
1  1.948745  1.448855  1.574837
------------------------------------------
       col1      col2      col3
0 -1.802586  0.797385 -0.614944
1  1.948745  1.448855  1.574837
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN
Data Frame with Forward Fill:
       col1      col2      col3
0 -1.802586  0.797385 -0.614944
1  1.948745  1.448855  1.574837
2  1.948745  1.448855  1.574837
3  1.948745  1.448855  1.574837
4  1.948745  1.448855  1.574837
5  1.948745  1.448855  1.574837

## Limits on Filling while Reindexing

In [ ]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])

# Padding NAN's
print (df2.reindex_like(df1))

# Now Fill the NAN's with preceding Values
print ("Data Frame with Forward Fill limiting to 1:")
print (df2.reindex_like(df1,method='ffill',limit=1))

       col1      col2      col3
0  0.331906  0.532431 -0.740473
1 -0.306413  0.576612  0.237036
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN
Data Frame with Forward Fill limiting to 1:
       col1      col2      col3
0  0.331906  0.532431 -0.740473
1 -0.306413  0.576612  0.237036
2 -0.306413  0.576612  0.237036
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

## Renaming

In [ ]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
print (df1)

print ("After renaming the rows and columns:")
print (df1.rename(columns={'col1' : 'c1', 'col2' : 'c2'},
index = {0 : 'apple', 1 : 'banana', 2 : 'durian'}))

       col1      col2      col3
0  0.601735 -1.545637  0.855664
1  0.427331  0.688290  0.019248
2 -0.965093 -0.462462  0.006993
3 -0.052593  2.024734  0.737861
4 -1.147529  1.177524 -0.821518
5  1.159880  1.378285  1.721024
After renaming the rows and columns:
              c1        c2      col3
apple   0.601735 -1.545637  0.855664
banana  0.427331  0.688290  0.019248
durian -0.965093 -0.462462  0.006993
3      -0.052593  2.024734  0.737861
4      -1.147529  1.177524 -0.821518
5       1.159880  1.378285  1.721024

# Iteration

##### 1.Series − values

#####  2.DataFrame − column labels

##### 3.Panel − item labels

In [ ]:
# The behavior of basic iteration over Pandas objects depends on the type.
# When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. 
# Other data structures, like DataFrame and Panel, 
# follow the dict-like convention of iterating over the keys of the objects.

### iteritems() − to iterate over the (key,value) pairs

### iterrows() − iterate over the rows as (index,series) pairs

### itertuples() − iterate over the rows as namedtuples

In [ ]:
N=20
df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
   })

print(df)
print("----------------------")

for col in df:
    print (col)

            A     x         y       C           D
0  2016-01-01   0.0  0.469103    High   99.066739
1  2016-01-02   1.0  0.384756    High   98.289580
2  2016-01-03   2.0  0.625836    High   94.166828
3  2016-01-04   3.0  0.085611     Low   94.143489
4  2016-01-05   4.0  0.926223    High   99.673420
5  2016-01-06   5.0  0.167170     Low   86.072877
6  2016-01-07   6.0  0.894346    High  103.924591
7  2016-01-08   7.0  0.845146     Low   95.557201
8  2016-01-09   8.0  0.802943     Low   96.591446
9  2016-01-10   9.0  0.428487     Low  114.261771
10 2016-01-11  10.0  0.341035  Medium  109.705745
11 2016-01-12  11.0  0.405861    High  113.263162
12 2016-01-13  12.0  0.990110  Medium   93.247052
13 2016-01-14  13.0  0.527849  Medium   89.724544
14 2016-01-15  14.0  0.988412    High   90.491433
15 2016-01-16  15.0  0.845841  Medium  117.717130
16 2016-01-17  16.0  0.357223  Medium  103.798182
17 2016-01-18  17.0  0.074222    High   87.119847
18 2016-01-19  18.0  0.526142  Medium  104.608526
19 2016-01-20  19.0  0.285774    High  110.322365
----------------------
A
x
y
C
D

###### iteritems()

In [ ]:
df = pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
print(df)
print("-------------------------")
for key,value in df.iteritems():
    print (key,value)
    print("---------------")
    
for key in df.iteritems():
    print (key)
    print("---------------")

       col1      col2      col3
0 -0.128477  0.884155 -0.056975
1  0.343058  0.096183 -0.374702
2  0.292324  0.693211 -0.539174
3  0.005020  0.946078  0.741041
-------------------------
col1 0   -0.128477
1    0.343058
2    0.292324
3    0.005020
Name: col1, dtype: float64
---------------
col2 0    0.884155
1    0.096183
2    0.693211
3    0.946078
Name: col2, dtype: float64
---------------
col3 0   -0.056975
1   -0.374702
2   -0.539174
3    0.741041
Name: col3, dtype: float64
---------------
('col1', 0   -0.128477
1    0.343058
2    0.292324
3    0.005020
Name: col1, dtype: float64)
---------------
('col2', 0    0.884155
1    0.096183
2    0.693211
3    0.946078
Name: col2, dtype: float64)
---------------
('col3', 0   -0.056975
1   -0.374702
2   -0.539174
3    0.741041
Name: col3, dtype: float64)
---------------

###### iterrows()

In [ ]:
df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])
print(df)
print("-------------------------")
for row_index,row in df.iterrows():
    print (row_index,row)
    print("---------------")

       col1      col2      col3
0  0.809363  0.286709 -0.767682
1  0.656351  0.602912  1.319677
2  0.646347 -0.099229  0.542436
3  1.023947  0.327090 -0.582042
-------------------------
0 col1    0.809363
col2    0.286709
col3   -0.767682
Name: 0, dtype: float64
---------------
1 col1    0.656351
col2    0.602912
col3    1.319677
Name: 1, dtype: float64
---------------
2 col1    0.646347
col2   -0.099229
col3    0.542436
Name: 2, dtype: float64
---------------
3 col1    1.023947
col2    0.327090
col3   -0.582042
Name: 3, dtype: float64
---------------

###### itertuples()

In [ ]:
df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])
print(df)
print("-------------------------")
for row in df.itertuples():
    print (row)
    print("---------------------------")

       col1      col2      col3
0 -0.998443 -0.929647 -1.133552
1 -0.173873 -0.240203  1.570984
2  0.356646  0.161227 -0.505193
3 -0.340915 -0.928790 -1.026224
-------------------------
Pandas(Index=0, col1=-0.9984427029901235, col2=-0.9296471834806882, col3=-1.133551518232767)
---------------------------
Pandas(Index=1, col1=-0.1738726250626595, col2=-0.24020304142022353, col3=1.5709836342664254)
---------------------------
Pandas(Index=2, col1=0.3566456337577536, col2=0.16122701604262574, col3=-0.5051929786018774)
---------------------------
Pandas(Index=3, col1=-0.34091476226138295, col2=-0.928790482160012, col3=-1.0262235012138607)
---------------------------

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])
print(df)
print("-------------------------")
for index, row in df.iterrows():
    row['a'] = 10
print (df)

       col1      col2      col3
0  0.696836 -0.016777 -1.774341
1 -0.800332 -0.993427 -0.431193
2  0.398850 -0.179831 -0.465011
3  0.778632 -0.962137 -0.048974
-------------------------
       col1      col2      col3
0  0.696836 -0.016777 -1.774341
1 -0.800332 -0.993427 -0.431193
2  0.398850 -0.179831 -0.465011
3  0.778632 -0.962137 -0.048974

# Sorting

## By label
## By Actual Value

In [ ]:
import pandas as pd
import numpy as np

unsorted_df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])
print(unsorted_df)
sorted_df=unsorted_df.sort_index()
sorted_df

       col2      col1
1 -0.176378  0.721343
4  1.684814 -1.319425
6  0.465002  0.937533
2  0.932386  0.274484
3 -0.920671  0.482813
5 -0.007957  1.063145
9  1.036918 -0.858404
8 -1.153024  2.384066
0  0.351306  1.229098
7  1.180061 -0.706423

       col2      col1
0  0.351306  1.229098
1 -0.176378  0.721343
2  0.932386  0.274484
3 -0.920671  0.482813
4  1.684814 -1.319425
5 -0.007957  1.063145
6  0.465002  0.937533
7  1.180061 -0.706423
8 -1.153024  2.384066
9  1.036918 -0.858404

## By Label

In [ ]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])

sorted_df=unsorted_df.sort_index()
sorted_df

       col2      col1
0  0.951641 -1.176113
1 -0.149623 -0.201677
2 -0.587801 -0.317945
3 -0.693631 -1.947263
4  1.356048  1.558692
5 -2.127452  0.603313
6  0.415249 -2.427123
7  1.351355  3.074737
8 -0.308721 -0.280288
9 -0.193055 -0.185155

## Order of Sorting

In [ ]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])

sorted_df = unsorted_df.sort_index(ascending=False)
sorted_df

       col2      col1
9  0.655889 -0.133394
8  0.479283 -0.918355
7  0.067283 -0.172217
6 -0.394113 -0.505226
5 -0.224754  0.593272
4  0.199818  0.357087
3  0.239788  0.454363
2  0.608632  1.507153
1  0.802041 -0.234182
0  0.550254 -0.395527

## Sort the Columns

In [ ]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
sorted_df=unsorted_df.sort_index(axis=1)
sorted_df

       col1      col2
1  0.554013  0.095632
4  1.604642  0.658729
6  0.259505 -0.028877
2  0.506667  1.710806
3  0.544958 -0.100091
5 -0.009247 -0.226838
9  1.922264 -0.168075
8  0.191701 -0.204255
0 -1.175025  0.939515
7 -0.770926 -1.472450

## Sorting Algorithm

In [ ]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1' ,kind='mergesort')
sorted_df

   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

# Text Data

#### 1	lower() Converts strings in the Series/Index to lower case.
####
#### 2	upper() Converts strings in the Series/Index to upper case.
####
#### 3	len() Computes String length().
####
#### 4	strip() Helps strip whitespace(including newline) from each string in the Series/index from both the sides.
####
#### 5	split(' ') Splits each string with the given pattern.
####
#### 6	cat(sep=' ') Concatenates the series/index elements with given separator.
####
#### 7	get_dummies() Returns the DataFrame with One-Hot Encoded values.
####
#### 8	contains(pattern) Returns a Boolean value True for each element if the substring contains in the element, else False.
####
#### 9  replace(a,b) Replaces the value a with the value b.
####
#### 10 repeat(value) Repeats each element with specified number of times.
####
#### 11	count(pattern) Returns count of appearance of pattern in each element.
####
#### 12	startswith(pattern) Returns true if the element in the Series/Index starts with the pattern.
####
#### 13	endswith(pattern)  Returns true if the element in the Series/Index ends with the pattern.
####
#### 14	find(pattern) Returns the first position of the first occurrence of the pattern.
####
#### 15	findall(pattern) Returns a list of all occurrence of the pattern.
####
#### 16	swapcase  Swaps the case lower/upper.
####
#### 17	islower() Checks whether all characters in each string in the Series/Index in lower case or not. Returns Boolean
####
#### 18	isupper() Checks whether all characters in each string in the Series/Index in upper case or not. Returns Boolean.
####
#### 19	isnumeric() Checks whether all characters in each string in the Series/Index are numeric. Returns Boolean.

In [ ]:
import pandas as pd
import numpy as np

s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

s
a=s.str.lower()
b=s.str.upper()
c=s.str.len()
print(s)
print("------------lower--------------")
print(a)
print("------------uppor--------------")
print(b)
print("-------------len-------------")
print(c)

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [ ]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

a=s.str.lower()
b=s.str.upper()
c=s.str.len()
print(s)
print("------------lower--------------")
print(a)
print("------------uppor--------------")
print(b)
print("-------------len-------------")
print(c)

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object
------------lower--------------
0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object
------------uppor--------------
0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object
-------------len-------------
0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [ ]:
s = pd.Series(['Tom  ', 'William Rick  ', 'John  ', 'Alber@t'])
print(s)
print ("Split Pattern:")
s.str.split(' ')

0             Tom
1    William Rick
2            John
3           Alber@t
dtype: object
Split Pattern:

0              [Tom, , ]
1    [William, Rick, , ]
2             [John, , ]
3              [Alber@t]
dtype: object

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

s.str.cat(sep='_')

'Tom _ William Rick_John_Alber@t'

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

s.str.get_dummies()

    William Rick  Alber@t  John  Tom
0              0        0     0     1
1              1        0     0     0
2              0        0     1     0
3              0        1     0     0

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

s.str.contains(' ')

0     True
1     True
2    False
3    False
dtype: bool

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])
print (s)
print ("After replacing @ with $:")
s.str.replace('@','$')

0             Tom
1     William Rick
2             John
3          Alber@t
dtype: object
After replacing @ with $:

0             Tom
1     William Rick
2             John
3          Alber$t
dtype: object

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

s.str.repeat(2)

0                      Tom Tom
1     William Rick William Rick
2                      JohnJohn
3                Alber@tAlber@t
dtype: object

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

print ("The number of 'm's in each string:")
s.str.count('m')

The number of 'm's in each string:

0    1
1    1
2    0
3    0
dtype: int64

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

print ("Strings that start with 'T':")
s.str. startswith ('T')

Strings that start with 'T':

0     True
1    False
2    False
3    False
dtype: bool

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])
print ("Strings that end with 't':")
s.str.endswith('t')

Strings that end with 't':

0    False
1    False
2    False
3     True
dtype: bool

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

s.str.find('e')

0   -1
1   -1
2   -1
3    3
dtype: int64

In [ ]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])

s.str.findall('e')

0     []
1     []
2     []
3    [e]
dtype: object

In [ ]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t'])
s.str.swapcase()

0             tOM
1    wILLIAM rICK
2            jOHN
3         aLBER@T
dtype: object

In [ ]:
s = pd.Series(['tom', 'William Rick', 'John', 'Alber@t'])
s.str.islower()

0     True
1    False
2    False
3    False
dtype: bool

In [ ]:
s = pd.Series(['TOM', 'William Rick', 'John', 'Alber@t'])

s.str.isupper()

0     True
1    False
2    False
3    False
dtype: bool

In [ ]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t'])

s.str.isnumeric()

0    False
1    False
2    False
3    False
dtype: bool

# Options and Customization

## get_option()
## set_option()
## reset_option()
## describe_option()
## option_context()

### get_option(param)

In [ ]:
import pandas as pd
print("display.max_rows")
print(pd.get_option("display.max_rows"))
print("display.max_columns")
print (pd.get_option("display.max_columns"))

display.max_rows
60
display.max_columns
20

### set_option(param,value)

In [ ]:
pd.set_option("display.max_rows",80)
print("Change the max rows")
print (pd.get_option("display.max_rows"))
pd.set_option("display.max_columns",30)
print("Change the max columns")
print (pd.get_option("display.max_columns"))

Change the max rows
80
Change the max columns
30

### reset_option(param)

In [ ]:
pd.reset_option("display.max_rows")
print (pd.get_option("display.max_rows"))
pd.reset_option("display.max_columns")
print (pd.get_option("display.max_columns"))

60
20

### describe_option(param)

In [ ]:
pd.describe_option("display.max_rows")

display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]

In [ ]:
pd.describe_option("display.max_columns")

display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 0] [currently: 0]

In [ ]:
with pd.option_context("display.max_rows",10):
    print(pd.get_option("display.max_rows"))
    print(pd.get_option("display.max_rows"))

10
10

# Indexing and Selecting Data

## 1.loc()-Label based

## 2.iloc()-Integer based

## 3.ix()-Both Label and Integer based

# .loc()

#### single scalar label
#### list of labels
#### slice object
#### Boolean array

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

print(df)
print("----------------------------------------")
#select all rows for a specific column
print (df.loc[:,'A'])
print("----------------------------------------")
# Select all rows for multiple columns, say list[]
print (df.loc[:,['A','C']])
print("----------------------------------------")
# Select few rows for multiple columns, say list[]
print (df.loc[['a','b','f','h'],['A','C']])
print("----------------------------------------")
# Select range of rows for all columns
print (df.loc['a':'e'])
print("----------------------------------------")
# for getting values with a boolean array
print (df.loc['a']>0)
print("----------------------------------------")
# for getting values with a boolean array
print (df>0)

          A         B         C         D
a  0.227747  1.122365  1.315731 -0.261359
b  1.822500 -0.574526  3.599579  0.821923
c  0.834830 -0.754508  0.161621  1.878189
d -1.203812  1.248114 -0.089176  0.067376
e -0.879965  0.574576  0.515250  0.847327
f  0.828375 -0.171245 -1.143161  1.253081
g  0.619149 -1.044557 -0.771564 -0.252449
h -1.337810  0.000550 -0.596813  1.297031
----------------------------------------
a    0.227747
b    1.822500
c    0.834830
d   -1.203812
e   -0.879965
f    0.828375
g    0.619149
h   -1.337810
Name: A, dtype: float64
----------------------------------------
          A         C
a  0.227747  1.315731
b  1.822500  3.599579
c  0.834830  0.161621
d -1.203812 -0.089176
e -0.879965  0.515250
f  0.828375 -1.143161
g  0.619149 -0.771564
h -1.337810 -0.596813
----------------------------------------
          A         C
a  0.227747  1.315731
b  1.822500  3.599579
f  0.828375 -1.143161
h -1.337810 -0.596813
----------------------------------------
          A         B         C         D
a  0.227747  1.122365  1.315731 -0.261359
b  1.822500 -0.574526  3.599579  0.821923
c  0.834830 -0.754508  0.161621  1.878189
d -1.203812  1.248114 -0.089176  0.067376
e -0.879965  0.574576  0.515250  0.847327
----------------------------------------
A     True
B     True
C     True
D    False
Name: a, dtype: bool
----------------------------------------
       A      B      C      D
a   True   True   True  False
b   True  False   True   True
c   True  False   True   True
d  False   True  False   True
e  False   True   True   True
f   True  False  False   True
g   True  False  False  False
h  False   True  False   True

# .iloc()

## 0-based indexing

### Integer
### list of integers
### range of values

In [ ]:
# import the pandas library and aliasing as pd
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

print(df)
print("----------------------------------------")

# select all rows for a specific column
print (df.iloc[:4])

print("----------------------------------------")
# Integer slicing[row,col]
print (df.iloc[1:5, 2:4])

print("----------------------------------------")
# Slicing through list of values
print (df.iloc[[1, 3, 5], [1, 3]])
print("----------------------------------------")
print (df.iloc[1:3, :])
print("----------------------------------------")
print (df.iloc[:,1:3])
print("----------------------------------------")

          A         B         C         D
0  0.197683  1.284703 -1.186312  0.243199
1  0.595383 -1.968393  1.400212 -1.554957
2  1.638912 -0.343612  0.810869 -2.284399
3  1.892892  0.252268  1.236760 -0.276994
4  0.231191 -1.003299  1.381410 -0.770001
5  2.635923 -1.317094  0.556144  0.662918
6 -0.528518 -0.209682 -1.026075  1.030338
7 -1.324937 -0.934585  0.548056 -1.432788
----------------------------------------
          A         B         C         D
0  0.197683  1.284703 -1.186312  0.243199
1  0.595383 -1.968393  1.400212 -1.554957
2  1.638912 -0.343612  0.810869 -2.284399
3  1.892892  0.252268  1.236760 -0.276994
----------------------------------------
          C         D
1  1.400212 -1.554957
2  0.810869 -2.284399
3  1.236760 -0.276994
4  1.381410 -0.770001
----------------------------------------
          B         D
1 -1.968393 -1.554957
3  0.252268 -0.276994
5 -1.317094  0.662918
----------------------------------------
          A         B         C         D
1  0.595383 -1.968393  1.400212 -1.554957
2  1.638912 -0.343612  0.810869 -2.284399
----------------------------------------
          B         C
0  1.284703 -1.186312
1 -1.968393  1.400212
2 -0.343612  0.810869
3  0.252268  1.236760
4 -1.003299  1.381410
5 -1.317094  0.556144
6 -0.209682 -1.026075
7 -0.934585  0.548056
----------------------------------------

# .ix()

## hybrid method for selections and subsetting the object

In [ ]:
import pandas as pd
import numpy as np
import sys
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

print(df)
# Integer slicing
print (df.ix[:4])

          A         B         C         D
0 -0.587891 -1.989858 -0.394193 -0.789454
1 -0.208494 -0.451296  0.857345  1.129054
2 -0.696672  0.123776 -0.360295  0.891509
3 -0.612386  0.776178  1.879543 -0.239012
4 -1.614926  0.864426  0.343249  0.454800
5  0.663516 -1.077774  1.282332 -1.870881
6  0.615719  0.038384 -2.377752 -0.022681
7  0.141457  0.565090 -1.716846  0.488644
          A         B         C         D
0 -0.587891 -1.989858 -0.394193 -0.789454
1 -0.208494 -0.451296  0.857345  1.129054
2 -0.696672  0.123776 -0.360295  0.891509
3 -0.612386  0.776178  1.879543 -0.239012
4 -1.614926  0.864426  0.343249  0.454800

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

# Statistical Functions

## Percent_change
Series and DatFrames have the function pct_change(). This function compares every element with its prior element and computes the change percentage.By default, the pct_change() operates on columns; if you want to apply the same row wise, then use 
##### axis=1() argument.

In [ ]:
import pandas as pd
import numpy as np
s = pd.Series([1,2,3,4,5,4])
print(s)
print("--------------------------")
print (s.pct_change())

df = pd.DataFrame(np.random.randn(5, 2))
print(df)
print("--------------------------")
print (df.pct_change())

0    1
1    2
2    3
3    4
4    5
5    4
dtype: int64
--------------------------
0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64
          0         1
0  1.484910 -0.617742
1 -1.027008 -0.004800
2  0.221494  0.673904
3  1.196372  0.084609
4 -2.383107 -0.355813
--------------------------
          0           1
0       NaN         NaN
1 -1.691630   -0.992229
2 -1.215669 -141.384387
3  4.401378   -0.874449
4 -2.991945   -5.205377

## Covariance
Covariance is applied on series data. 
The Series object has a method cov to compute covariance between series objects.
NA will be excluded automatically.

### Cov Series

In [ ]:
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))

print(s1)
print("----------------------")
print(s2)
print("----------------------")
print (s1.cov(s2))

0   -1.501316
1    0.026901
2   -1.287457
3    0.164336
4    1.796291
5   -0.211072
6    1.336489
7   -1.550325
8   -1.763407
9    0.997184
dtype: float64
----------------------
0   -0.376201
1   -0.375206
2    1.075562
3   -1.270089
4   -2.122021
5    0.097421
6   -0.628169
7    0.013656
8    0.722428
9    0.303987
dtype: float64
----------------------
-0.8013754090696936

## Cov columns

N:B-Observe the cov between a and b column in the first statement and the same is the value returned by cov on DataFrame.

# Correlation

Correlation shows the linear relationship between any two array of values (series). 
There are multiple methods to compute the correlation like pearson(default), spearman and kendall.

N:B-If any non-numeric column is present in the DataFrame, it is excluded automatically.

In [ ]:
frame = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])
print(frame)
print("-----------------------")
print(frame['a'].corr(frame['b']))
print("-----------------------")
print (frame.corr())

          a         b         c         d         e
0  0.333990 -0.441555  1.838871 -1.119555  0.600505
1  1.350492  0.886628  0.133797  0.169119  0.236085
2 -0.145368  2.453176  0.353547 -1.219101  1.344477
3 -0.713534  0.624477 -0.935100 -0.005074  0.627080
4 -0.993827  1.617011  0.733419 -0.914772 -1.079662
5  0.048118 -0.588770 -0.234062  0.960131  1.072553
6  0.169381 -0.416867  0.184780 -0.437518  1.621967
7 -1.682019 -0.729135  0.822733 -1.280734  0.653966
8  0.337202 -1.308642  1.090014  0.998060 -0.996104
9  0.360203 -0.803640 -0.374819  2.271872  0.721852
-----------------------
-0.0909177357912145
-----------------------
          a         b         c         d         e
a  1.000000 -0.090918 -0.018323  0.464209  0.080480
b -0.090918  1.000000 -0.155633 -0.492642  0.021127
c -0.018323 -0.155633  1.000000 -0.478763 -0.353899
d  0.464209 -0.492642 -0.478763  1.000000 -0.092960
e  0.080480  0.021127 -0.353899 -0.092960  1.000000

# Data Ranking

Rank optionally takes a parameter ascending which by default is true; 
when false, data is reverse-ranked, with larger values assigned a smaller rank.

Rank supports different tie-breaking methods, specified with the method parameter

average − average rank of tied group

min − lowest rank in the group

max − highest rank in the group

first − ranks assigned in the order they appear in the array

In [ ]:
s = pd.Series(np.random.randn(5), index=list('abcde'))
print(s)
#s['d'] = s['b'] # so there's a tie
print (s.rank())

a   -0.649987
b   -0.791483
c    1.099957
d    1.498697
e   -1.120973
dtype: float64
a    3.0
b    2.0
c    4.0
d    5.0
e    1.0
dtype: float64

# Window Functions

## .rolling() Function

This function can be applied on a series of data. 
Specify the window=n argument and apply the appropriate statistical function on top of it

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),                   
index = pd.date_range('1/1/2000', periods=10),
columns = ['A', 'B', 'C', 'D'])
print (df.rolling(window=3).mean())

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03 -0.355176 -0.497197 -0.754811 -0.521911
2000-01-04 -0.581600 -0.333234 -0.918173 -0.474948
2000-01-05  0.149737 -0.303143 -0.262876 -0.346426
2000-01-06  0.371931  0.173186  0.086755 -0.081250
2000-01-07  0.811980  0.062059 -0.499685 -0.342443
2000-01-08  0.676746  0.253550 -0.701064 -0.616310
2000-01-09  0.578237  0.154248 -0.465024 -1.070646
2000-01-10  0.680482  0.224583  0.325093 -0.525061

Since the window size is 3, 
for first two elements there are nulls and from third the value will be the average of the n, n-1 and n-2 elements. 
Thus we can also apply various functions as mentioned above.

# .expanding() Function

This function can be applied on a series of data. 
Specify the min_periods=n argument and apply the appropriate statistical function on top of it.

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df.expanding(min_periods=3).mean())

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03 -0.047910  0.243136  0.998788 -0.040776
2000-01-04 -0.542528 -0.238123  0.605545 -0.426651
2000-01-05 -0.550803 -0.349210  0.574455 -0.383647
2000-01-06 -0.505185 -0.242004  0.207957 -0.183690
2000-01-07 -0.486452 -0.222578  0.075093 -0.371500
2000-01-08 -0.421113 -0.129157 -0.067041 -0.276082
2000-01-09 -0.501251 -0.172554 -0.046293 -0.256697
2000-01-10 -0.427698  0.051972  0.002970 -0.146050

# .ewm() Function

ewm is applied on a series of data.
Specify any of the com, span, halflife argument and apply the appropriate statistical function on top of it. 
It assigns the weights exponentially.

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df.ewm(com=0.5).mean())

                   A         B         C         D
2000-01-01 -0.221277 -0.105950 -2.015244 -1.210970
2000-01-02 -0.339916  1.351820 -0.775545  0.591233
2000-01-03 -1.337528  1.025298 -1.165305  0.405541
2000-01-04 -0.715051  0.502928 -1.279293  0.470560
2000-01-05 -0.062274  1.081718 -1.293153  0.515224
2000-01-06  0.352552  0.331221 -0.302150  0.897758
2000-01-07  0.258823 -0.248684  0.382490  0.778726
2000-01-08 -0.552006 -0.588933  1.037440  0.220311
2000-01-09 -0.041116  0.205791  0.735098 -0.308264
2000-01-10 -0.341454  0.758021  0.315329  0.768907

# Aggregations

## Aggregations on DataFrame

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df)
r = df.rolling(window=3,min_periods=1)
print (r)

                   A         B         C         D
2000-01-01 -0.319540  0.865204  0.487971 -0.340908
2000-01-02 -0.569263  0.597622 -0.085488  1.918426
2000-01-03  1.605550 -0.497329 -0.852241 -0.432925
2000-01-04 -0.254126 -0.391687  0.483095 -0.803540
2000-01-05  0.385637 -0.759144 -0.137531  0.118716
2000-01-06 -1.270387 -0.485218  0.417227 -0.162263
2000-01-07 -0.210191 -0.870753 -0.782190 -0.744043
2000-01-08  1.384670 -0.501805 -0.719954  0.426295
2000-01-09  0.310769 -0.716913 -1.831518  0.573065
2000-01-10 -1.082649  0.259588 -0.133760 -0.220571
Rolling [window=3,min_periods=1,center=False,axis=0]

We can aggregate by passing a function to the entire DataFrame, or select a column via the standard get item method.

## Aggregation on a Whole Dataframe

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df)
print ("------------------------------------")
r = df.rolling(window=3,min_periods=1)
print (r.aggregate(np.sum))

                   A         B         C         D
2000-01-01  0.339376 -2.093728  0.478811 -0.376120
2000-01-02 -0.532188  0.218475 -0.662791  0.058168
2000-01-03 -0.586225 -0.353761  0.126455  0.811643
2000-01-04 -0.420692 -0.093387 -1.328611  1.646543
2000-01-05  0.846874  0.058724 -1.449543 -0.395112
2000-01-06 -0.822700  0.486749 -0.186516  0.326825
2000-01-07 -0.058331 -2.347856  1.119276 -0.672415
2000-01-08 -1.801710  0.695473 -1.065686 -1.002167
2000-01-09 -0.178839  0.248666  0.672457 -0.689541
2000-01-10 -0.760971 -0.068141  0.106871  0.261064
------------------------------------
                   A         B         C         D
2000-01-01  0.339376 -2.093728  0.478811 -0.376120
2000-01-02 -0.192812 -1.875252 -0.183980 -0.317951
2000-01-03 -0.779038 -2.229013 -0.057525  0.493691
2000-01-04 -1.539106 -0.228673 -1.864947  2.516353
2000-01-05 -0.160044 -0.388425 -2.651700  2.063073
2000-01-06 -0.396519  0.452086 -2.964671  1.578256
2000-01-07 -0.034157 -1.802383 -0.516783 -0.740702
2000-01-08 -2.682741 -1.165634 -0.132925 -1.347757
2000-01-09 -2.038880 -1.403717  0.726047 -2.364124
2000-01-10 -2.741520  0.875997 -0.286358 -1.430644

## Aggregation on a Single Column of a Dataframe

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df)
print("--------------------------------")
r = df.rolling(window=3,min_periods=1)
print (r['A'].aggregate(np.sum))

                   A         B         C         D
2000-01-01 -0.303902  0.864165  0.748708  1.697681
2000-01-02  0.992555 -0.486319 -0.718528 -0.259037
2000-01-03  0.385017 -1.513036 -0.484198 -0.956654
2000-01-04 -0.540801 -0.593090 -0.883190  1.481240
2000-01-05  0.783115  0.804089 -0.252903  0.889230
2000-01-06 -0.635043  0.865351 -1.050035 -1.023158
2000-01-07  0.245996 -1.487478 -1.118039 -0.538766
2000-01-08  0.204314 -0.607259  0.344726 -0.538182
2000-01-09 -0.920681 -0.479081 -1.578011 -1.937885
2000-01-10  0.850013  0.635859 -1.054205  0.577379
--------------------------------
2000-01-01   -0.303902
2000-01-02    0.688653
2000-01-03    1.073670
2000-01-04    0.836771
2000-01-05    0.627331
2000-01-06   -0.392729
2000-01-07    0.394068
2000-01-08   -0.184733
2000-01-09   -0.470372
2000-01-10    0.133645
Freq: D, Name: A, dtype: float64

## Aggregation on Multiple Columns of a DataFrame

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df)
print ("------------------------------------")
r = df.rolling(window=3,min_periods=1)
print (r[['A','B']].aggregate(np.sum))

                   A         B         C         D
2000-01-01 -0.636514 -0.457869 -0.280058 -1.003815
2000-01-02 -1.242148  0.924135 -0.918198  0.153620
2000-01-03  0.153920 -0.575609  0.404590  0.302217
2000-01-04  0.341757  0.880055 -0.523554  0.500790
2000-01-05 -1.142520  0.981559  0.075006  1.306971
2000-01-06 -0.979805  0.095956 -0.917603  1.320233
2000-01-07 -0.430364  0.437538  1.422111  1.223051
2000-01-08  1.957286 -1.129704 -1.809615 -0.233858
2000-01-09  0.196643  0.589086  0.774109  1.283920
2000-01-10 -0.971523  1.882637 -0.688909  0.462239
------------------------------------
                   A         B
2000-01-01 -0.636514 -0.457869
2000-01-02 -1.878662  0.466267
2000-01-03 -1.724742 -0.109342
2000-01-04 -0.746471  1.228582
2000-01-05 -0.646843  1.286006
2000-01-06 -1.780567  1.957571
2000-01-07 -2.552689  1.515053
2000-01-08  0.547117 -0.596210
2000-01-09  1.723565 -0.103081
2000-01-10  1.182406  1.342018

## Multiple Functions on a Single Column of a DataFrame

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df)
print ("------------------------------------")
r = df.rolling(window=3,min_periods=1)
print (r['A'].aggregate([np.sum,np.mean]))

                   A         B         C         D
2000-01-01 -0.857227 -0.145764  0.855763 -2.052630
2000-01-02 -0.101351  0.889760  0.676481  0.759866
2000-01-03  1.425826 -0.033234  0.617306  0.323292
2000-01-04 -0.473358 -0.604464 -1.144603 -1.290999
2000-01-05  0.625437 -1.517308  0.137624 -0.464273
2000-01-06 -1.278332 -1.095048 -0.826218 -1.400258
2000-01-07 -0.323251  0.218328 -0.299253 -0.751908
2000-01-08 -1.430160 -0.561661 -0.609853 -1.835458
2000-01-09  1.993146 -0.067826  0.952493 -1.124862
2000-01-10 -0.458167  1.200760  0.170938  0.142498
------------------------------------
                 sum      mean
2000-01-01 -0.857227 -0.857227
2000-01-02 -0.958579 -0.479289
2000-01-03  0.467247  0.155749
2000-01-04  0.851117  0.283706
2000-01-05  1.577905  0.525968
2000-01-06 -1.126252 -0.375417
2000-01-07 -0.976145 -0.325382
2000-01-08 -3.031743 -1.010581
2000-01-09  0.239735  0.079912
2000-01-10  0.104820  0.034940

## Multiple Functions on Multiple Columns of a DataFrame

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])
print (df)
print ("------------------------------------")
r = df.rolling(window=3,min_periods=1)
print(r[['A','B']].aggregate([np.sum,np.mean]))

                   A         B         C         D
2000-01-01 -0.451195 -0.052515  0.832134  0.340260
2000-01-02 -0.903172  0.208264  2.090629 -0.698972
2000-01-03 -1.129315  0.387692 -0.039233  0.973254
2000-01-04  1.023003  0.422587 -0.045246  1.742119
2000-01-05  0.265932  0.514171 -0.263427  0.207634
2000-01-06 -0.316453 -0.354600 -0.784363  0.632124
2000-01-07 -0.668108 -0.188655 -0.595742  0.055858
2000-01-08 -1.920022 -1.439592  0.555157 -0.547701
2000-01-09 -1.239196  0.018230  0.258139  1.640846
2000-01-10 -0.094751 -1.071072 -0.127711 -0.956501
------------------------------------
                   A                   B
                 sum      mean       sum      mean
2000-01-01 -0.451195 -0.451195 -0.052515 -0.052515
2000-01-02 -1.354367 -0.677183  0.155748  0.077874
2000-01-03 -2.483682 -0.827894  0.543440  0.181147
2000-01-04 -1.009485 -0.336495  1.018543  0.339514
2000-01-05  0.159619  0.053206  1.324450  0.441483
2000-01-06  0.972481  0.324160  0.582158  0.194053
2000-01-07 -0.718630 -0.239543 -0.029085 -0.009695
2000-01-08 -2.904584 -0.968195 -1.982848 -0.660949
2000-01-09 -3.827326 -1.275775 -1.610017 -0.536672
2000-01-10 -3.253969 -1.084656 -2.492434 -0.830811

## Different Functions to Different Columns of a Dataframe

In [ ]:
df = pd.DataFrame(np.random.randn(3, 4),
   index = pd.date_range('1/1/2000', periods=3),
   columns = ['A', 'B', 'C', 'D'])
print (df)
print ("------------------------------------")
r = df.rolling(window=3,min_periods=1)
print (r.aggregate({'A' : np.sum,'B' : np.mean}))

                   A         B         C         D
2000-01-01  0.015896  0.245859 -1.837012  2.087316
2000-01-02 -0.219205 -0.236824 -0.260937 -0.492843
2000-01-03 -0.183465  0.908343  0.367161  0.572624
------------------------------------
                   A         B
2000-01-01  0.015896  0.245859
2000-01-02 -0.203309  0.004517
2000-01-03 -0.386775  0.305792

# Missing Data

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df)

        one       two     three
a  2.266484 -0.085099  1.666502
b       NaN       NaN       NaN
c  0.302056 -1.116180 -0.741985
d       NaN       NaN       NaN
e -1.703449 -0.946450  0.975381
f  0.059689 -0.094803  1.560669
g       NaN       NaN       NaN
h  1.419191 -0.585118 -1.086383

## NaN means Not a Number.

 ## 1.isnull()
 ## 2.notnull()

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df['one'].isnull())
print("----------------------")
print (df['one'].notnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
----------------------
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [ ]:
import pandas as pd
import numpy as np
data = pd.read_csv("athlete_events.csv")
data

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
5,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
7,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN
9,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
10,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
11,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
12,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
13,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
14,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
15,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 30 kilometres,NaN
16,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
17,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
18,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
19,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
20,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
21,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
22,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
23,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 30 kilometres,NaN
24,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
25,7,John Aalberg,M,33.0,183.0,72.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
26,8,"Cornelia ""Cor"" Aalten (-Strannood)",F,18.0,168.0,NaN,Netherlands,NED,1932 Summer,1932,Summer,Los Angeles,Athletics,Athletics Women's 100 metres,NaN
27,8,"Cornelia ""Cor"" Aalten (-Strannood)",F,18.0,168.0,NaN,Netherlands,NED,1932 Summer,1932,Summer,Los Angeles,Athletics,Athletics Women's 4 x 100 metres Relay,NaN
28,9,Antti Sami Aalto,M,26.0,186.0,96.0,Finland,FIN,2002 Winter,2002,Winter,Salt Lake City,Ice Hockey,Ice Hockey Men's Ice Hockey,NaN
29,10,"Einar Ferdinand ""Einari"" Aalto",M,26.0,NaN,NaN,Finland,FIN,1952 Summer,1952,Summer,Helsinki,Swimming,Swimming Men's 400 metres Freestyle,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271086,135555,Micha Zych,M,23.0,177.0,68.0,Poland,POL,2006 Winter,2006,Winter,Torino,Figure Skating,Figure Skating Mixed Ice Dancing,NaN
271087,135556,Bogusaw Stanisaw Zychowicz,M,19.0,189.0,80.0,Poland,POL,1980 Summer,1980,Summer,Moskva,Swimming,Swimming Men's 100 metres Butterfly,NaN
271088,135556,Bogusaw Stanisaw Zychowicz,M,19.0,189.0,80.0,Poland,POL,1980 Summer,1980,Summer,Moskva,Swimming,Swimming Men's 200 metres Butterfly,NaN
271089,135557,Dominik ycki,M,34.0,192.0,95.0,Poland,POL,2008 Summer,2008,Summer,Beijing,Sailing,Sailing Men's Two Person Keelboat,NaN
271090,135557,Dominik ycki,M,38.0,192.0,95.0,Poland,POL,2012 Summer,2012,Summer,London,Sailing,Sailing Men's Two Person Keelboat,NaN
271091,135558,ukasz Tomasz ygado,M,32.0,200.0,89.0,Poland,POL,2012 Summer,2012,Summer,London,Volleyball,Volleyball Men's Volleyball,NaN
271092,135559,Pawe Jan Zygmunt,M,21.0,182.0,79.0,Poland,POL,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Men's 1,500 metres",NaN
271093,135559,Pawe Jan Zygmunt,M,21.0,182.0,79.0,Poland,POL,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Men's 5,000 metres",NaN
271094,135559,Pawe Jan Zygmunt,M,25.0,182.0,79.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Speed Skating,"Speed Skating Men's 1,500 metres",NaN
271095,135559,Pawe Jan Zygmunt,M,25.0,182.0,79.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Speed Skating,"Speed Skating Men's 5,000 metres",NaN
271096,135559,Pawe Jan Zygmunt,M,29.0,182.0,79.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Speed Skating,"Speed Skating Men's 5,000 metres",NaN
271097,135559,Pawe Jan Zygmunt,M,29.0,182.0,79.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Speed Skating,"Speed Skating Men's 10,000 metres",NaN
271098,135559,Pawe Jan Zygmunt,M,33.0,182.0,79.0,Poland,POL,2006 Winter,2006,Winter,Torino,Speed Skating,"Speed Skating Men's 5,000 metres",NaN
271099,135560,Stavroula Zygouri,F,36.0,171.0,63.0,Greece,GRE,2004 Summer,2004,Summer,Athina,Wrestling,"Wrestling Women's Middleweight, Freestyle",NaN
271100,135561,Frantiek Zyka,M,26.0,NaN,NaN,Czechoslovakia,TCH,1928 Summer,1928,Summer,Amsterdam,Athletics,Athletics Men's Marathon,NaN
271101,135562,Milan Zyka,M,24.0,173.0,68.0,Czechoslovakia,TCH,1972 Summer,1972,Summer,Munich,Cycling,"Cycling Men's Team Pursuit, 4,000 metres",NaN
271102,135563,Olesya Nikolayevna Zykina,F,19.0,171.0,64.0,Russia,RUS,2000 Summer,2000,Summer,Sydney,Athletics,Athletics Women's 4 x 400 metres Relay,Bronze
271103,135563,Olesya Nikolayevna Zykina,F,23.0,171.0,64.0,Russia,RUS,2004 Summer,2004,Summer,Athina,Athletics,Athletics Women's 4 x 400 metres Relay,Silver
271104,135564,Yevgeny Aleksandrovich Zykov,M,22.0,172.0,65.0,Russia-1,RUS,2002 Winter,2002,Winter,Salt Lake City,Luge,Luge Mixed (Men)'s Doubles,NaN
271105,135565,Fernando scar Zylberberg,M,23.0,168.0,76.0,Argentina,ARG,2000 Summer,2000,Summer,Sydney,Hockey,Hockey Men's Hockey,NaN
271106,135565,Fernando scar Zylberberg,M,27.0,168.0,76.0,Argentina,ARG,2004 Summer,2004,Summer,Athina,Hockey,Hockey Men's Hockey,NaN
271107,135566,"James Francis ""Jim"" Zylker",M,21.0,175.0,75.0,United States,USA,1972 Summer,1972,Summer,Munich,Football,Football Men's Football,NaN
271108,135567,Aleksandr Viktorovich Zyuzin,M,24.0,183.0,72.0,Russia,RUS,2000 Summer,2000,Summer,Sydney,Rowing,Rowing Men's Lightweight Coxless Fours,NaN
271109,135567,Aleksandr Viktorovich Zyuzin,M,28.0,183.0,72.0,Russia,RUS,2004 Summer,2004,Summer,Athina,Rowing,Rowing Men's Lightweight Coxless Fours,NaN
271110,135568,Olga Igorevna Zyuzkova,F,33.0,171.0,69.0,Belarus,BLR,2016 Summer,2016,Summer,Rio de Janeiro,Basketball,Basketball Women's Basketball,NaN
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

In [ ]:
print (data['Weight'].isnull())

0         False
1         False
2          True
3          True
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26         True
27         True
28        False
29         True
          ...
271086    False
271087    False
271088    False
271089    False
271090    False
271091    False
271092    False
271093    False
271094    False
271095    False
271096    False
271097    False
271098    False
271099    False
271100     True
271101    False
271102    False
271103    False
271104    False
271105    False
271106    False
271107    False
271108    False
271109    False
271110    False
271111    False
271112    False
271113    False
271114    False
271115    False
Name: Weight, Length: 271116, dtype: bool

In [ ]:
import pandas as pd
import numpy as np
data = pd.read_csv("data.csv")
print(data)

      A     B     C     D
0   1.0   2.0   3.0   5.0
1   NaN   4.0   5.0  10.0
2   3.0   6.0   7.0   NaN
3   4.0   8.0   9.0  20.0
4   5.0   NaN   NaN  25.0
5   NaN  12.0  13.0   NaN
6   7.0  14.0  15.0  35.0
7   8.0   NaN  17.0  40.0
8   NaN  18.0  19.0  45.0
9  10.0  20.0  21.0  50.0

In [ ]:
print (data['A'].sum())

38.0

In [ ]:
df = pd.DataFrame(index=[0,1,2,3,4,5],columns=['one','two'])
print(df)
print (df['one'].sum())

   one  two
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN
5  NaN  NaN
0

## Cleaning / Filling Missing Data

In [ ]:
df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one',
'two', 'three'])

df = df.reindex(['a', 'b', 'c'])

print (df)
print ("NaN replaced with '0':")
print (df.fillna(0))

        one       two     three
a -0.642305 -0.603400 -0.944232
b       NaN       NaN       NaN
c  1.242212 -0.952358 -1.916920
NaN replaced with '0':
        one       two     three
a -0.642305 -0.603400 -0.944232
b  0.000000  0.000000  0.000000
c  1.242212 -0.952358 -1.916920

## Fill NA Forward and Backward

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
print("-----------------------------")
print (df.fillna(method='pad'))

        one       two     three
a  1.146033 -0.149642  0.277404
b       NaN       NaN       NaN
c -0.010095  2.248349  0.664187
d       NaN       NaN       NaN
e -1.198900 -1.368529 -0.059725
f -0.348196  0.309328 -2.120937
g       NaN       NaN       NaN
h -0.043159 -0.915848 -0.033562
-----------------------------
        one       two     three
a  1.146033 -0.149642  0.277404
b  1.146033 -0.149642  0.277404
c -0.010095  2.248349  0.664187
d -0.010095  2.248349  0.664187
e -1.198900 -1.368529 -0.059725
f -0.348196  0.309328 -2.120937
g -0.348196  0.309328 -2.120937
h -0.043159 -0.915848 -0.033562

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
print("-----------------------------")
print (df.fillna(method='backfill'))

        one       two     three
a -1.630344 -0.497175  1.272994
b       NaN       NaN       NaN
c -0.572398  0.619612  1.105527
d       NaN       NaN       NaN
e  1.222902 -0.442529  0.591567
f  0.107577 -2.533396  0.753795
g       NaN       NaN       NaN
h  0.884141  1.352075  0.603482
-----------------------------
        one       two     three
a -1.630344 -0.497175  1.272994
b -0.572398  0.619612  1.105527
c -0.572398  0.619612  1.105527
d  1.222902 -0.442529  0.591567
e  1.222902 -0.442529  0.591567
f  0.107577 -2.533396  0.753795
g  0.884141  1.352075  0.603482
h  0.884141  1.352075  0.603482

# Drop Missing Values

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])


df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
print("-----------------------------")
print (df.dropna())

        one       two     three
a -0.827668  0.556166  0.126810
b       NaN       NaN       NaN
c  0.164537  1.098938 -0.893576
d       NaN       NaN       NaN
e -0.241608 -0.443362  0.255676
f -0.041445 -1.668323  0.451631
g       NaN       NaN       NaN
h -0.410398 -0.227468  0.756156
-----------------------------
        one       two     three
a -0.827668  0.556166  0.126810
c  0.164537  1.098938 -0.893576
e -0.241608 -0.443362  0.255676
f -0.041445 -1.668323  0.451631
h -0.410398 -0.227468  0.756156

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
print("-----------------------------")
print (df.dropna(axis=1))

        one       two     three
a  0.299527 -1.172651 -0.701408
b       NaN       NaN       NaN
c  0.997185 -0.090804 -0.014353
d       NaN       NaN       NaN
e -0.699106  0.149991 -0.514226
f -0.589308  0.896113 -0.320995
g       NaN       NaN       NaN
h  0.257417  2.454714 -0.959687
-----------------------------
Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

# Replace Missing (or) Generic Values

In [ ]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df)
print("-----------------------------")
print (df.replace({1000:10,2000:60}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60
-----------------------------
   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [ ]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df)
print("-----------------------------")
print (df.replace({1000:10,2000:60}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60
-----------------------------
   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

a = np.arange(4)
print(a)
p = np.linspace(0, 100, 6001)
ax = plt.gca()
lines = [
    ('linear', None),
    ('higher', '--'),
    ('lower', '--'),
    ('nearest', '-.'),
    ('midpoint', '-.'),
]
for interpolation, style in lines:
    ax.plot(
        p, np.percentile(a, p, interpolation=interpolation),
        label=interpolation, linestyle=style)
ax.set(
    title='Interpolation methods for list: ' + str(a),
    xlabel='Percentile',
    ylabel='List item returned',
    yticks=a)
ax.legend()
plt.show()

[0 1 2 3]

In [ ]:
data= pd.DataFrame({'One':[4,6,8,10]},columns=['One'])
print(data)
print("-----------------------")
data.describe()

   One
0    4
1    6
2    8
3   10
-----------------------

             One
count   4.000000
mean    7.000000
std     2.581989
min     4.000000
25%     5.500000
50%     7.000000
75%     8.500000
max    10.000000

# linear:(i+(j-i)*fraction) this is a normal function for linear interpolation method function named numpy.percentile

# For 25%

i=4 and j=6 fraction=3/4


calculation:

linear:(4+(6-4)*3/4)

In [ ]:
(4+(6-4)*(3/4))

5.5

# for 50%

i=6 and j=8 fraction=2/4


calculation:

linear:(6+(8-6)*(2/4))

In [ ]:
(6+(8-6)*(2/4))

7.0

# for 75%

i=8 and j=10 fraction=1/4

calculation:

linear:(8+(10-8)*(1/4))

In [ ]:
(8+(10-8)*(1/4))

8.5

# another method

# min+(max-min)*percentile

min=4
max=10
precentile=25%,50%,75%

In [ ]:
4+(10-4)*(1/4)     #------------------25%

5.5

In [ ]:
4+(10-4)*(2/4)    #------------------50%

7.0

In [ ]:
4+(10-4)*(3/4)     #------------------75%

8.5

# GroupBy

# groupby operation involves


## Splitting the Object

## Applying a function

## Combining the results

 # operations we perform
    
 ## Aggregation − computing a summary statistic

 ## Transformation − perform some group-specific operation

 ## Filtration − discarding the data with some condition

In [ ]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

# Split Data into Groups

## obj.groupby('key')
## obj.groupby(['key1','key2'])
## obj.groupby(key,axis=1)

In [ ]:
df.groupby('Team')

In [ ]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [ ]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

# Iterating through Groups

In [ ]:
grouped = df.groupby('Year')

for name,group in grouped:
    print (name)
    print (group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

# Select a Group

In [ ]:
print (grouped.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

# Aggregations

In [ ]:
print (grouped['Points'].agg(np.mean))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [ ]:
grouped = df.groupby('Team')
grouped.agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [ ]:
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

# Transformations

In [ ]:
grouped = df.groupby('Team')
score = lambda x: (x - x.mean()) / x.std()*10
grouped.transform(score)

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4   11.547005 -10.910895  -8.608621
5         NaN        NaN        NaN
6   -5.773503   2.182179  -2.360428
7   -5.773503   8.728716  10.969049
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

# Filtration

In [ ]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

# Merging/Joining

#### left − A DataFrame object.

#### right − Another DataFrame object.

#### on − Columns (names) to join on. Must be found in both the left and right DataFrame objects.

#### left_on − Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.

#### right_on − Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.

#### left_index − If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.

#### right_index − Same usage as left_index for the right DataFrame.

#### how − One of 'left', 'right', 'outer', 'inner'. Defaults to inner. Each method has been described below.

#### sort − Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve the performance substantially in many cases.

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (left)
print (right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [ ]:
pd.merge(left,right,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [ ]:
 pd.merge(left,right,on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

# Left Join

In [ ]:
pd.merge(left, right, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

# Right Join

In [ ]:
pd.merge(left, right, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

# Outer Join

In [ ]:
pd.merge(left, right, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

# Inner Join

In [ ]:
pd.merge(left, right, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

# Concatenation

## objs − This is a sequence or mapping of Series, DataFrame, or Panel objects.

## axis − {0, 1, ...}, default 0. This is the axis to concatenate along.

## join − {‘inner’, ‘outer’}, default ‘outer’. How to handle indexes on other axis(es). Outer for union and inner for intersection.

## ignore_index − boolean, default False. If True, do not use the index values on the concatenation axis. The resulting axis will be labeled 0, ..., n - 1.

## join_axes − This is the list of Index objects. Specific indexes to use for the other (n-1) axes instead of performing inner/outer set logic.

In [ ]:
import pandas as pd

one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])
pd.concat([one,two])

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [ ]:
pd.concat([one,two],keys=['x','y'])

       Name subject_id  Marks_scored
x 1    Alex       sub1            98
  2     Amy       sub2            90
  3   Allen       sub4            87
  4   Alice       sub6            69
  5  Ayoung       sub5            78
y 1   Billy       sub2            89
  2   Brian       sub4            80
  3    Bran       sub3            79
  4   Bryce       sub6            97
  5   Betty       sub5            88

In [ ]:
pd.concat([one,two],keys=['x','y'],ignore_index=True)

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [ ]:
 pd.concat([one,two],axis=1)

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

In [ ]:
one.append(two)

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [ ]:
one.append([two,one,two])

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88